Tekla Open API Reference for Tekla Structures 2025
Chamfer Constructor
 Creates a chamfer instance with the basic shape type CHAMFER_NONE.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Chamfer()
Public Sub New
See Also
Reference
Chamfer Class
Chamfer Overload
Tekla.Structures.Model Namespace